InformationRegisters/ПубличныеИдентификаторыБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ПубличныеИдентификаторыБухгалтерии</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПубличныйИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриОбмене</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПравилаПроверки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиОтражения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроблемыПриПроверке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Множественный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СвязанныеИдентификаторы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>700</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дополнительный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавигационнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаУдаления</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проведен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиОтраженияДокументовВБухгалтерии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>НастройкиОтраженияДокументовВБухгалтерии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.СинхронизацияДанныхЧерезУниверсальныйФормат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаОтражения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоОбновленияУниверсальная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверкаВыполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательДляИнтеграции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РазделыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РазделУчета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторМетаданных</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/СовместноеИспользование/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// См. ОчередьЗаданийПереопределяемый.ПриОпределенииПсевдонимовОбработчиков
//
Процедура ПриОпределенииПсевдонимовОбработчиков(СоответствиеИменПсевдонимам) Экспорт
	
	СоответствиеИменПсевдонимам.Вставить(ОбработчикЗаданияОбновленияДанных().ИмяМетода);
	
КонецПроцедуры

// Возвращает сведения о состоянии отражения документа в учете.
//
// Параметры:
//  Ссылка - ЛюбаяСсылка - ссылка на объект, для которого нужно получить данные.
//
// Возвращаемое значение:
//  Структура:
//   * ИзмененияЗарегистрированы - Булево - изменения объекта зарегистрированы на узле обмена.
//   * УчаствуетВОтражении - Булево - объект участвует в отражении.
//   * УчаствуетВОтраженииПояснение - Строка - пояснение, если объект не участвует в отражении.
//   * СвязанныеДокументы - ТаблицаЗначений:
//     ** НавигационнаяСсылка - Строка - навигационная ссылка для перехода к объекту внешнего приложения.
//     ** Представление - Строка - представление объекта во внешнем приложении.
//     ** ТипДанных - Строка - представление типа объекта во внешнем приложении.
//     ** Проведен - Булево - документ проведен во внешнем приложении.
//     ** ЕстьОшибкиОтражения - Булево - есть расхождения отражения в бизнесе и во внешнем приложении.
//
Функция СведенияОбОтраженииВУчете(Ссылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ИзмененияЗарегистрированы", Ложь);
	Результат.Вставить("УчаствуетВОтражении", Ложь);
	Результат.Вставить("УчаствуетВОтраженииПояснение", "");
	Результат.Вставить("СвязанныеДокументы");
	
	ТекущаяНастройка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	ОписаниеНастройки = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ОписаниеНастройки(ТекущаяНастройка);
	НастройкиУзлаОбмена = Справочники.НастройкиОтраженияДокументовВБухгалтерии.НастройкиУзлаОбмена();  
	
	Результат.ИзмененияЗарегистрированы = ПланыОбмена.ИзменениеЗарегистрировано(ОписаниеНастройки.УзелОбмена, Ссылка);
	
	ВыгружаемыйОбъект = Ссылка.ПолучитьОбъект();
	
	УзлыПолучатели = ОбменДаннымиСобытия.ОпределитьПолучателей(
		ВыгружаемыйОбъект,
		ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(ОписаниеНастройки.УзелОбмена));
		
	ПояснениеКВыгрузке = Неопределено;
	Если ВыгружаемыйОбъект.ДополнительныеСвойства.Свойство("СовместноеИспользованиеПояснениеКВыгрузке", ПояснениеКВыгрузке) Тогда
		Результат.УчаствуетВОтраженииПояснение = ПояснениеКВыгрузке;
	КонецЕсли;
	
	Результат.Вставить("СвязанныеДокументы", ДанныеПубличныхИдентификаторов(ОписаниеНастройки.УзелОбмена, Ссылка));

	Если НастройкиУзлаОбмена.ПереноситьЗаказыКакСчетаНаОплату 
		И ТипЗнч(Ссылка) = Тип("ДокументСсылка.СчетНаОплату") Тогда  
		Если Результат.СвязанныеДокументы.Количество() > 0 Тогда
			Результат.УчаствуетВОтражении = Истина;
		Иначе
			Результат.УчаствуетВОтражении = Ложь;
		КонецЕсли;
			
	ИначеЕсли НЕ НастройкиУзлаОбмена.ПереноситьЗаказыКакСчетаНаОплату 
		И ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя")
		И Ссылка.ВидОперации <> Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда  
		Если Результат.СвязанныеДокументы.Количество() > 0 Тогда
			Результат.УчаствуетВОтражении = Истина;
		Иначе
			Результат.УчаствуетВОтражении = Ложь;
		КонецЕсли;  
		
	Иначе
		Результат.УчаствуетВОтражении = (УзлыПолучатели.Найти(ОписаниеНастройки.УзелОбмена) <> Неопределено);
	КонецЕсли;     
	
	Возврат Результат;
	
КонецФункции

// Обработчик задания очереди.
//
Процедура ОбновитьДанныеПубличныхИдентификаторовБухгалтерии() Экспорт
	
	РегистрыСведений.ПубличныеИдентификаторыБухгалтерии.ВыполнитьОбновлениеДанных(Ложь);
	
КонецПроцедуры

// См. обработчик ПриСозданииНаСервере модуля формы клиентского приложения. 
//
// Параметры:
//  ОписаниеКонтекста - см. СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия.
//  Контейнер - ГруппаФормы - родительский контейнер для добавления элементов отображения.
//
Процедура ПриСозданииНаСервере(ОписаниеКонтекста, Контейнер) Экспорт
	
	Если Не ДоступнаРаботаСОтражениемДокументов() Тогда
		Контейнер.Видимость = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрыИнформационнойПанели = СохраненныеПараметрыИнформационнойПанели(ОписаниеКонтекста);
	Если ПараметрыИнформационнойПанели = Неопределено Тогда
		ПараметрыИнформационнойПанели = ПараметрыИнформационнойПанели();
	КонецЕсли;
	ПараметрыИнформационнойПанели.ИмяКонтейнера = Контейнер.Имя;
	
	ЗаполнитьПсевдонимыЭлементовПанелиСостоянияОтражения(ПараметрыИнформационнойПанели.ПсевдонимыЭлементов);
	Для Каждого ЭлементСловаря Из ПараметрыИнформационнойПанели.ПсевдонимыЭлементов Цикл
		ПараметрыИнформационнойПанели.ПсевдонимыЭлементов[ЭлементСловаря.Ключ] = ЭлементСловаря.Ключ + "_" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "");
	КонецЦикла;
	
	// Добавление элементов для отображения состояния отражения.
	ДобавитьЭлементыПанелиСостоянияОтражения(ОписаниеКонтекста.Форма, Контейнер, ПараметрыИнформационнойПанели.ПсевдонимыЭлементов);
	
	// Отображение состояния отражения.
	Если ЗначениеЗаполнено(ОписаниеКонтекста.Объект.Ссылка) Тогда
		УстановитьОтображениеИнформационнойПанели(ОписаниеКонтекста, ПараметрыИнформационнойПанели);
	Иначе
		Контейнер.Видимость = Ложь;
	КонецЕсли;
	
	СохранитьПараметрыИнформационнойПанели(ОписаниеКонтекста, ПараметрыИнформационнойПанели);
	
КонецПроцедуры

// См. обработчик ПослеЗаписиНаСервере модуля формы клиентского приложения. 
//
// Параметры:
//  ОписаниеКонтекста - см. СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия.
//
Процедура ПослеЗаписиНаСервере(ОписаниеКонтекста) Экспорт
	
	Если Не ДоступнаРаботаСОтражениемДокументов() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИнформационнойПанели = СохраненныеПараметрыИнформационнойПанели(ОписаниеКонтекста);
	
	Контейнер = ОписаниеКонтекста.Форма.Элементы.Найти(ПараметрыИнформационнойПанели.ИмяКонтейнера);
	Контейнер.Видимость = Истина;
	
	УстановитьОтображениеИнформационнойПанели(ОписаниеКонтекста, ПараметрыИнформационнойПанели);
	
КонецПроцедуры

// Обновляет состояние отражения документа в информационной панели.
//
// Параметры:
//  ОписаниеКонтекста - см. СовместноеИспользованиеКлиентСервер.КонтекстОбработкиСобытия.
//
Процедура ОбновитьИнформационнуюПанель(ОписаниеКонтекста) Экспорт
	
	Если Не ДоступнаРаботаСОтражениемДокументов() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыИнформационнойПанели = СохраненныеПараметрыИнформационнойПанели(ОписаниеКонтекста);
	Если ПараметрыИнформационнойПанели <> Неопределено Тогда
		УстановитьОтображениеИнформационнойПанели(ОписаниеКонтекста, ПараметрыИнформационнойПанели);
	КонецЕсли;
	
КонецПроцедуры

// Навигационная ссылка для перехода из текущего приложения к объекту во внешнем приложении.
//
// Параметры:
//  НавигационнаяСсылка - Строка - локальная навигационная ссылка внешнего приложения.
//  ИдентификаторПриложения - Строка - идентификатор внешнего приложения,
//    как он задан в СовместноеИспользованиеКлиентСерверПереопределяемый.ЗаполнитьПрефиксыНавигационныхСсылок.
//
// Возвращаемое значение:
//  Строка
//
Функция НавигационнаяСсылкаВнешнегоПриложения(НавигационнаяСсылка, ИдентификаторПриложения) Экспорт
	
	Префикс = "";
	
	Для Каждого СоответствиеПрефикса Из СовместноеИспользованиеКлиентСервер.ПрефиксыНавигационныхСсылок() Цикл
		Если СоответствиеПрефикса.Значение = ИдентификаторПриложения Тогда
			Префикс = СоответствиеПрефикса.Ключ;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Префикс + НавигационнаяСсылка;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ДоступныеРазделыУчета() Экспорт
	
	ТаблицаРазделы = Новый ТаблицаЗначений;
	ТаблицаРазделы.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка"));
	ТаблицаРазделы.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	СовместноеИспользованиеПереопределяемый.ЗаполнитьДоступныеРазделыУчета(ТаблицаРазделы);
	
	Возврат ТаблицаРазделы;
	
КонецФункции

Функция СоответствиеВидовДокументовИРазделовУчета() Экспорт
	
	ТаблицаСоответствие = Новый ТаблицаЗначений;
	ТаблицаСоответствие.Колонки.Добавить("РазделУчета", Новый ОписаниеТипов("Строка"));
	ТаблицаСоответствие.Колонки.Добавить("ИмяОбъектаМетаданных", Новый ОписаниеТипов("Строка"));
	ТаблицаСоответствие.Колонки.Добавить("ПолноеИмяМетаданных", Новый ОписаниеТипов("Строка"));
	ТаблицаСоответствие.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ТаблицаСоответствие.Колонки.Добавить("ЕстьОрганизация", Новый ОписаниеТипов("Булево"));
	ТаблицаСоответствие.Колонки.Добавить("РазрешеноПроведение", Новый ОписаниеТипов("Булево"));
	
	СовместноеИспользованиеПереопределяемый.ЗаполнитьСоответствиеВидовДокументовИРазделовУчета(ТаблицаСоответствие);
	
	Возврат ТаблицаСоответствие;
	
КонецФункции

Функция ИсточникиДанныхСинхронизируемыхОбъектов() Экспорт
	
	ИсточникиДанных = Новый ТаблицаЗначений;
	ИсточникиДанных.Колонки.Добавить("ИдентификаторРаздела", Новый ОписаниеТипов("Строка"));
	ИсточникиДанных.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Тип"));
	ИсточникиДанных.Колонки.Добавить("ТекстЗапроса", Новый ОписаниеТипов("Строка"));
	
	СовместноеИспользованиеПереопределяемый.ЗаполнитьИсточникиДанныхСинхронизируемыхОбъектов(ИсточникиДанных);
	
	ИсточникиДанных.Колонки.Добавить("МетаданныеОбъекта");
	ИсточникиДанных.Колонки.Добавить("ИмяТаблицы");
	
	Для Каждого ОписаниеИсточника Из ИсточникиДанных Цикл
		ОписаниеИсточника.МетаданныеОбъекта = Метаданные.НайтиПоТипу(ОписаниеИсточника.ТипСсылки);
		ОписаниеИсточника.ИмяТаблицы = ОписаниеИсточника.МетаданныеОбъекта.ПолноеИмя();
	КонецЦикла;
	
	Возврат ИсточникиДанных;
	
КонецФункции

Функция ПравилаПроверкиДанных() Экспорт
	
	ПравилаПроверки = Новый ТаблицаЗначений;
	ПравилаПроверки.Колонки.Добавить("ТипСсылки", Новый ОписаниеТипов("Тип"));
	ПравилаПроверки.Колонки.Добавить("ВерсияПравила", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	
	СовместноеИспользованиеПереопределяемый.ЗаполнитьТаблицуПравилПроверки(ПравилаПроверки);
	
	ПравилаПроверки.Колонки.Добавить("ПустаяСсылка", Новый ОписаниеТипов(ПравилаПроверки.ВыгрузитьКолонку("ТипСсылки")));
	Для Каждого СтрокаПравило Из ПравилаПроверки Цикл
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(СтрокаПравило.ТипСсылки);
		
		Описание = Новый ОписаниеТипов(МассивТипов);
		СтрокаПравило.ПустаяСсылка = Описание.ПривестиЗначение(Неопределено);
	КонецЦикла;
	
	Возврат ПравилаПроверки;
	
КонецФункции

Функция ОбработчикЗаданияОбновленияДанных() Экспорт
	
	ОписаниеОбработчика = Новый Структура;
	ОписаниеОбработчика.Вставить("ИмяМетода", "СовместноеИспользование.ОбновитьДанныеПубличныхИдентификаторовБухгалтерии");
	
	РасписаниеЗадания = Новый РасписаниеРегламентногоЗадания;
	РасписаниеЗадания.ПериодПовтораВТечениеДня = 5 * 60;
	РасписаниеЗадания.ПериодПовтораДней = 1;
	
	ОписаниеОбработчика.Вставить("РасписаниеПоУмолчанию", РасписаниеЗадания);
	
	Возврат ОписаниеОбработчика;
	
КонецФункции

Функция ПубличныеИдентификаторыСинхронизируемыхОбъектов(УзелОбмена, СписокСсылок) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПубличныеИдентификаторы.Ссылка КАК Ссылка,
	|	ПубличныеИдентификаторы.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторы
	|ГДЕ
	|	ПубличныеИдентификаторы.Ссылка В(&СписокСсылок)
	|	И ПубличныеИдентификаторы.УзелИнформационнойБазы = &УзелОбмена");
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	Запрос.УстановитьПараметр("СписокСсылок", СписокСсылок);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДоступнаВыборочнаяВыгрузка() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Процедура ДобавитьСтрокуИнформации(СтрокиИнформации, Тип, Содержание, Ссылка = Неопределено, Идентификатор = "", ИдентификаторМетаданных = "") Экспорт 
	
	НоваяСтрока = СтрокиИнформации.Добавить();
	НоваяСтрока.Тип = Тип;
	НоваяСтрока.Содержание = Содержание;
	НоваяСтрока.Ссылка = Ссылка;
	НоваяСтрока.Идентификатор = Идентификатор;
	НоваяСтрока.ИдентификаторМетаданных = ИдентификаторМетаданных;   
	НоваяСтрока.Порядок = ПорядокПоТипуИнформации(Тип);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДоступнаРаботаСОтражениемДокументов()
	
	УстановитьПривилегированныйРежим(Истина);
	ОтражениеВключено = ОтражениеДокументовВключено();
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ОтражениеВключено И Пользователи.ЭтоПолноправныйПользователь();
	
КонецФункции

Функция ОтражениеДокументовВключено()
	
	НастройкаСсылка = Справочники.НастройкиОтраженияДокументовВБухгалтерии.ТекущаяНастройка();
	Если НастройкаСсылка.Пустая() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаСсылка, "ОтражениеВключено");
	
КонецФункции

Процедура ЗаполнитьПсевдонимыЭлементовПанелиСостоянияОтражения(ПсевдонимыЭлементов)
	
	ПсевдонимыЭлементов.Вставить("ОсновнаяГруппа");
	ПсевдонимыЭлементов.Вставить("КартинкаСтатуса");
	ПсевдонимыЭлементов.Вставить("НадписьСтатуса");
	
КонецПроцедуры

Процедура ДобавитьЭлементыПанелиСостоянияОтражения(Форма, Контейнер, ПсевдонимыЭлементов)
	
	// Основная группа.
	ОсновнаяГруппа = Форма.Элементы.Добавить(ПсевдонимыЭлементов.ОсновнаяГруппа, Тип("ГруппаФормы"), Контейнер);
	ОсновнаяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ОсновнаяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	ОсновнаяГруппа.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Центр;
	ОсновнаяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	ОсновнаяГруппа.ОтображатьЗаголовок = Ложь;
	
	// Картинка статуса.
	НовыйЭлемент = Форма.Элементы.Добавить(ПсевдонимыЭлементов.КартинкаСтатуса, Тип("ДекорацияФормы"), ОсновнаяГруппа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка = БиблиотекаКартинок.ЧасыПроцессОтложен;
	
	// Надпись статуса и гиперссылки.
	НовыйЭлемент = Форма.Элементы.Добавить(ПсевдонимыЭлементов.НадписьСтатуса, Тип("ДекорацияФормы"), ОсновнаяГруппа);
	НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
	НовыйЭлемент.АвтоМаксимальнаяШирина = Ложь;
	НовыйЭлемент.РастягиватьПоГоризонтали = Истина;
	НовыйЭлемент.УстановитьДействие("ОбработкаНавигационнойСсылки", ОбработчикСобытияИнформационнойПанели("ОбработкаНавигационнойСсылки"));
	
КонецПроцедуры

Процедура УстановитьОтображениеИнформационнойПанели(ОписаниеКонтекста, ПараметрыИнформационнойПанели)
	
	СостояниеОтражения = СведенияОбОтраженииВУчете(ОписаниеКонтекста.Объект.Ссылка);
		
	Элементы = ЭлементыИнформационнойПанели(ОписаниеКонтекста.Форма, ПараметрыИнформационнойПанели.ПсевдонимыЭлементов);
	
	ДоступнаКомандаОтражения = ДоступнаВыборочнаяВыгрузка();
	
	ГиперссылкаКомандыОтражения = "ДействиеОтразитьДокумент";
	ГиперссылкаКомандыСкрыживателя = "ДействиеПерейтиВСкрыживатель";
	ГиперссылкаКомандыНастроекОтражения = "ДействиеПерейтиКНастройкамОтражения";
	
	Если СостояниеОтражения.УчаствуетВОтражении Тогда
		Если СостояниеОтражения.СвязанныеДокументы.Количество() = 0 Тогда
			Если СостояниеОтражения.ИзмененияЗарегистрированы Тогда
				Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
				Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.ЧасыПроцессОтложен;
				Если ДоступнаКомандаОтражения Тогда
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Документ <a href=""%1"">ожидает отражения</a> в бухгалтерии.'"),
						ГиперссылкаКомандыОтражения);
				Иначе
					Элементы.НадписьСтатуса.Заголовок = НСтр("ru = 'Документ ожидает отражения в бухгалтерии.'");
				КонецЕсли;
			Иначе
				Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
				Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
				Если ДоступнаКомандаОтражения Тогда
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Документ не отражен в бухгалтерии. <a href=""%1"">Отразить</a>'"),
						ГиперссылкаКомандыОтражения);
				Иначе
					Элементы.НадписьСтатуса.Заголовок = НСтр("ru = 'Документ не отражен в бухгалтерии.'");
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли СостояниеОтражения.СвязанныеДокументы.Количество() = 1 Тогда
			ДанныеСвязанногоДокумента = СостояниеОтражения.СвязанныеДокументы[0];
			Если СостояниеОтражения.ИзмененияЗарегистрированы Тогда
				Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
				Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.ЧасыПроцессОтложен;
				Если ДоступнаКомандаОтражения Тогда
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Документ изменен и <a href=""%1"">ожидает отражения</a>. В бухгалтерии документ доступен по ссылке: <a href=""%2"">%3</a>'"),
						ГиперссылкаКомандыОтражения,
						ДанныеСвязанногоДокумента.НавигационнаяСсылка,
						ДанныеСвязанногоДокумента.Представление);
				Иначе
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Документ изменен и ожидает отражения. В бухгалтерии документ доступен по ссылке: <a href=""%1"">%2</a>'"),
						ДанныеСвязанногоДокумента.НавигационнаяСсылка,
						ДанныеСвязанногоДокумента.Представление);
				КонецЕсли;
			Иначе
				Если Не ДанныеСвязанногоДокумента.Проведен Тогда
					Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
					Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'В бухгалтерии документ доступен по ссылке: <a href=""%1"">%2</a>, при проведении возникла <a href=""%3"">ошибка</a>.'"),
						ДанныеСвязанногоДокумента.НавигационнаяСсылка,
						ДанныеСвязанногоДокумента.Представление,
						ГиперссылкаКомандыСкрыживателя);
				ИначеЕсли ДанныеСвязанногоДокумента.ЕстьОшибкиОтражения Тогда
					Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
					Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Есть <a href=""%1"">расхождения отражения</a> в бизнесе и бухгалтерии. В бухгалтерии документ доступен по ссылке: <a href=""%2"">%3</a>'"),
						ГиперссылкаКомандыСкрыживателя,
						ДанныеСвязанногоДокумента.НавигационнаяСсылка,
						ДанныеСвязанногоДокумента.Представление);
				Иначе
					Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаБезПредупреждений;
					Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'В бухгалтерии документ доступен по ссылке: <a href=""%1"">%2</a>'"),
						ДанныеСвязанногоДокумента.НавигационнаяСсылка,
						ДанныеСвязанногоДокумента.Представление);
				КонецЕсли;
			КонецЕсли;
		Иначе
			Проведен = Истина;
			ЕстьОшибкиОтражения = Ложь;
			Для Каждого ДанныеСвязанногоДокумента Из СостояниеОтражения.СвязанныеДокументы Цикл
				Проведен = Проведен И ДанныеСвязанногоДокумента.Проведен;
				ЕстьОшибкиОтражения = ЕстьОшибкиОтражения Или ДанныеСвязанногоДокумента.ЕстьОшибкиОтражения;
			КонецЦикла;
			
			Если СостояниеОтражения.ИзмененияЗарегистрированы Тогда
				Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
				Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.ЧасыПроцессОтложен;
				Если ДоступнаКомандаОтражения Тогда
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Документ изменен и <a href=""%1"">ожидает отражения</a>. Ссылки для перехода к документу в бухгалтерии доступны <a href=""%2"">здесь</a>.'"),
						ГиперссылкаКомандыОтражения,
						ГиперссылкаКомандыСкрыживателя);
				Иначе
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Документ изменен и ожидает отражения. Ссылки для перехода к документу в бухгалтерии доступны <a href=""%1"">здесь</a>.'"),
						ГиперссылкаКомандыСкрыживателя);
				КонецЕсли;
			Иначе
				Если Не Проведен Тогда
					Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
					Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'При проведении документа в бухгалтерии возникла <a href=""%1"">ошибка</a>.'"),
						ГиперссылкаКомандыСкрыживателя);
				ИначеЕсли ЕстьОшибкиОтражения Тогда
					Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаСПредупреждениями;
					Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаСПредупреждениями;
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Есть <a href=""%1"">расхождения отражения</a> в бизнесе и бухгалтерии.'"),
						ГиперссылкаКомандыСкрыживателя);
				Иначе
					Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаБезПредупреждений;
					Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
					Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
						НСтр("ru = 'Ссылки для перехода к документу в бухгалтерии доступны <a href=""%1"">здесь</a>.'"),
						ГиперссылкаКомандыСкрыживателя);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Иначе
		Элементы.ОсновнаяГруппа.ЦветФона = ЦветаСтиля.ЦветФонаРазделаУчетаБезПредупреждений;
		Элементы.КартинкаСтатуса.Картинка = БиблиотекаКартинок.РазделУчетаБезПредупреждений;
		Элементы.НадписьСтатуса.Заголовок = СтроковыеФункции.ФорматированнаяСтрока(
			НСтр("ru = 'Документ не отражается в бухгалтерии. <a href=""%1"">Настроить отражение</a>'"),
			ГиперссылкаКомандыНастроекОтражения);
	КонецЕсли;
	
КонецПроцедуры

Функция ЭлементыИнформационнойПанели(Форма, ПсевдонимыЭлементов)
	
	Результат = Новый Структура;
	
	Для Каждого ЭлементСловаря Из ПсевдонимыЭлементов Цикл
		Результат.Вставить(ЭлементСловаря.Ключ, Форма.Элементы.Найти(ЭлементСловаря.Значение));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбработчикСобытияИнформационнойПанели(Действие)
	
	Возврат "Подключаемый_ИнформационнаяПанельСовместногоИспользования" + Действие;
	
Конецфункции

Функция СохраненныеПараметрыИнформационнойПанели(ОписаниеКонтекста)
	
	Возврат ОписаниеКонтекста.Форма[ОписаниеКонтекста.ИмяРеквизита];
	
КонецФункции

Процедура СохранитьПараметрыИнформационнойПанели(ОписаниеКонтекста, Параметры)
	
	ОписаниеКонтекста.Форма[ОписаниеКонтекста.ИмяРеквизита] = Параметры;
	
КонецПроцедуры

Функция ПараметрыИнформационнойПанели()
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяКонтейнера", "");
	Результат.Вставить("ПсевдонимыЭлементов", Новый Структура);
	Результат.Вставить("ВыполняетсяОбновлениеСведений", Ложь);
	
	Возврат Результат;
	
КонецФункции

Функция ДанныеПубличныхИдентификаторов(УзелОбмена, Ссылка)
	
	ДанныеИдентификаторов = Новый ТаблицаЗначений;
	ДанныеИдентификаторов.Колонки.Добавить("НавигационнаяСсылка", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("ТипДанных", Новый ОписаниеТипов("Строка"));
	ДанныеИдентификаторов.Колонки.Добавить("Проведен", Новый ОписаниеТипов("Булево"));
	ДанныеИдентификаторов.Колонки.Добавить("ЕстьОшибкиОтражения", Новый ОписаниеТипов("Булево"));
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеПубличныхИдентификаторов.НавигационнаяСсылка КАК НавигационнаяСсылка,
	|	ДанныеПубличныхИдентификаторов.Представление КАК Представление,
	|	ДанныеПубличныхИдентификаторов.ТипДанных КАК ТипДанных,
	|	ДанныеПубличныхИдентификаторов.Проведен КАК Проведен,
	|	ДанныеПубличныхИдентификаторов.ЕстьОшибкиОтражения КАК ЕстьОшибкиОтражения,
	|	ДанныеПубличныхИдентификаторов.Множественный КАК Множественный,
	|	ДанныеПубличныхИдентификаторов.СвязанныеИдентификаторы КАК СвязанныеИдентификаторы
	|ИЗ
	|	РегистрСведений.ПубличныеИдентификаторыСинхронизируемыхОбъектов КАК ПубличныеИдентификаторыСинхронизируемыхОбъектов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПубличныеИдентификаторыБухгалтерии КАК ДанныеПубличныхИдентификаторов
	|		ПО (ДанныеПубличныхИдентификаторов.Идентификатор = ПубличныеИдентификаторыСинхронизируемыхОбъектов.Идентификатор)
	|ГДЕ
	|	ПубличныеИдентификаторыСинхронизируемыхОбъектов.Ссылка = &Ссылка
	|	И ПубличныеИдентификаторыСинхронизируемыхОбъектов.УзелИнформационнойБазы = &УзелОбмена");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("УзелОбмена", УзелОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Множественный        
			И ЗначениеЗаполнено(Выборка.СвязанныеИдентификаторы) Тогда
			СвязанныеИдентификаторы = ОбщегоНазначения.JSONВЗначение(Выборка.СвязанныеИдентификаторы, , Ложь);       
			МассивДокументовБухгалтерии = Новый Массив;
			Для Каждого СтрокаИдентификатора Из СвязанныеИдентификаторы Цикл  
				ОписаниеОбъекта = СовместноеИспользованиеПереопределяемый.ОписаниеОбъектаБухгалтерии(СтрокаИдентификатора.Идентификатор, СтрокаИдентификатора.ИдентификаторМетаданных);
				СтрокаДанные = ДанныеИдентификаторов.Добавить();
				ЗаполнитьЗначенияСвойств(СтрокаДанные, ОписаниеОбъекта);
				СтрокаДанные.НавигационнаяСсылка = СовместноеИспользованиеКлиентСервер.НавигационнаяСсылкаВнешнегоПриложения(
					СтрокаДанные.НавигационнаяСсылка, "БухгалтерияПредприятия");
			КонецЦикла;      
		Иначе
			СтрокаДанные = ДанныеИдентификаторов.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДанные, Выборка);
			СтрокаДанные.НавигационнаяСсылка = СовместноеИспользованиеКлиентСервер.НавигационнаяСсылкаВнешнегоПриложения(
				СтрокаДанные.НавигационнаяСсылка, "БухгалтерияПредприятия");
		КонецЕсли;     
	КонецЦикла;
	
	Возврат ДанныеИдентификаторов;
	
КонецФункции

Функция ПорядокПоТипуИнформации(Тип)
	
	Если Тип = "Ошибка" Тогда
		Порядок = 10;
	ИначеЕсли Тип = "ЗаголовокОбщий" Тогда
		Порядок = 0;
	ИначеЕсли Тип = "ЗаголовокСсылки" Тогда
		Порядок = 20;
	Иначе
		Порядок = 50;
	КонецЕсли;
	
	Возврат Порядок;
	
КонецФункции

#КонецОбласти
